SigninLogs
| where TimeGenerated > ago(1h)
| where ResultType == 0
| where UserPrincipalName has "@"
| where AppDisplayName in~ ("Microsoft Azure PowerShell", "Microsoft Azure CLI", "Azure Portal")
| summarize LoginCount = count(), Applications = make_set(AppDisplayName), IPAddresses = make_set(IPAddress), Locations = make_set(Location), TimeSpan = max(TimeGenerated) - min(TimeGenerated) by UserPrincipalName, bin(TimeGenerated, 5m)
| where LoginCount >= 2
| where TimeSpan < 30m
| take 100
